In [2]:
import pandas as pd
import numpy as np

In [3]:
s = pd.Series([10,20,30,40])

In [4]:
print(s)

0    10
1    20
2    30
3    40
dtype: int64

In [5]:
data = {"Math": 90, "Physics": 85, "Chemistry": 88}

In [6]:
marks = pd.Series(data)

In [7]:
print(data)

{'Math': 90, 'Physics': 85, 'Chemistry': 88}

In [8]:
print(marks)

Math         90
Physics      85
Chemistry    88
dtype: int64

DataFrame in pandas

In [9]:
data = {
    "Name" : ["Aman" , "Krish" , "Karan"],
    "Age" : [22,23,21],
    "Marks" : [85,90,88]
}

In [10]:
print(data)

{'Name': ['Aman', 'Krish', 'Karan'], 'Age': [22, 23, 21], 'Marks': [85, 90, 88]}

In [11]:
type(data)

dict

In [12]:
marks = pd.DataFrame(data)

In [13]:
print(marks)

    Name  Age  Marks
0   Aman   22     85
1  Krish   23     90
2  Karan   21     88

In [14]:
marks.set_index("Name", inplace= True)

In [15]:
print(marks)

       Age  Marks
Name
Aman    22     85
Krish   23     90
Karan   21     88

In [16]:
df = pd.DataFrame({
    "Name" : ["Aman" , "saurav" , "Karan"],
    "Age": [22,23,21],
    "Marks" : [85,90,88]
})

In [17]:
df.head() #print first 5 rows but here we are having only 3

     Name  Age  Marks
0    Aman   22     85
1  saurav   23     90
2   Karan   21     88

In [18]:
df.tail() #print last 5

     Name  Age  Marks
0    Aman   22     85
1  saurav   23     90
2   Karan   21     88

In [19]:
df = pd.DataFrame({
    "Name" : ["Aman" , "saurav" , "Karan","shubham","abhishek","sameer"],
    "Age": [22,23,21,22,25,26],
    "Marks" : [85,90,88,90,56,70]
})

In [20]:
df.head(2)

     Name  Age  Marks
0    Aman   22     85
1  saurav   23     90

In [21]:
df.tail(2)

       Name  Age  Marks
4  abhishek   25     56
5    sameer   26     70

In [22]:
df.shape

(6, 3)

In [23]:
df.columns

Index(['Name', 'Age', 'Marks'], dtype='str')

In [24]:
df.info()

<class 'pandas.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    6 non-null      str
 1   Age     6 non-null      int64
 2   Marks   6 non-null      int64
dtypes: int64(2), str(1)
memory usage: 276.0 bytes

In [25]:
df.describe()

             Age      Marks
count   6.000000   6.000000
mean   23.166667  79.833333
std     1.940790  13.891244
min    21.000000  56.000000
25%    22.000000  73.750000
50%    22.500000  86.500000
75%    24.500000  89.500000
max    26.000000  90.000000

Selecting the Data

In [26]:
df["Name"]

0        Aman
1      saurav
2       Karan
3     shubham
4    abhishek
5      sameer
Name: Name, dtype: str

In [27]:
df[["Name" , "Marks"]]

       Name  Marks
0      Aman     85
1    saurav     90
2     Karan     88
3   shubham     90
4  abhishek     56
5    sameer     70

Filtering in Pandas

In [28]:
df[df["Marks"] > 85]

      Name  Age  Marks
1   saurav   23     90
2    Karan   21     88
3  shubham   22     90

Sorting + Value Counts

In [29]:
df.sort_values("Marks")

       Name  Age  Marks
4  abhishek   25     56
5    sameer   26     70
0      Aman   22     85
2     Karan   21     88
3   shubham   22     90
1    saurav   23     90

In [30]:
df.sort_values("Marks" , ascending = False)

       Name  Age  Marks
1    saurav   23     90
3   shubham   22     90
2     Karan   21     88
0      Aman   22     85
5    sameer   26     70
4  abhishek   25     56

In [31]:
df["Age"].value_counts()

Age
22    2
23    1
21    1
25    1
26    1
Name: count, dtype: int64

Handeling missing values

In [33]:
#Updating the dataset with null values
df = pd.DataFrame({
    "Name" : ["Aman" , "Saurav", "Karan" ,"Shubham" , None, "Sameer"],
    "Age" : [22,23,None,22,25,26],
    "Marks" : [85,None,88,90,56,None]
})
df

      Name   Age  Marks
0     Aman  22.0   85.0
1   Saurav  23.0    NaN
2    Karan   NaN   88.0
3  Shubham  22.0   90.0
4      NaN  25.0   56.0
5   Sameer  26.0    NaN

In [34]:
df.isnull() #checking the missing values

    Name    Age  Marks
0  False  False  False
1  False  False   True
2  False   True  False
3  False  False  False
4   True  False  False
5  False  False   True

In [36]:
df.isnull().sum() #counting the missing values

Name     1
Age      1
Marks    2
dtype: int64